adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
          <register>
            <name>MCPLLBUF</name>
            <description>Override for MCPLLBUF power switch</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SWITCH</name>
                <description>Power switch override value</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Force power switch OFF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ON</name>
                    <description>Force power switch ON</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESISTANCE</name>
                <description>Power switch resistance override value</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverride</name>
                    <description>No override enabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Override</name>
                    <description>Override enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRUP</name>
            <description>Override for power up</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MCPLLANA</name>
                <description>Override for PWRDUP_MCPLL</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Force power off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ON</name>
                    <description>Force power on</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverride</name>
                    <description>No override enabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Override</name>
                    <description>Override enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>OUTA_DRV</name>
          <description>Drive strength for OUTA</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OUTA_DRV</name>
              <description>Drive strength for OUTA</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTB_DRV</name>
          <description>Drive strength for OUTB</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OUTB_DRV</name>
              <description>Drive strength for OUTB</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTC_DRV</name>
          <description>Drive strength for OUTC</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OUTC_DRV</name>
              <description>Drive strength for OUTC</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTD_DRV</name>
          <description>Drive strength for OUTD</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OUTD_DRV</name>
              <description>Drive strength for OUTD</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMODE</name>
          <description>Integer mode</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTMODE</name>
              <description>Integer mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Fractional</name>
                  <description>Fractional mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Integer</name>
                  <description>Integer mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>ATE test bus control</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATE</name>
              <description>ATE test bus control</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ATB_ENABLE</name>
          <description>Analog switch control for connecting ATB to GPIOs.
        Note that when the analog switch is enabled, digital driver of the GPIO must be in hiZ.	  
   	    Note also that the analog switch can be enabled also from elsewhere for testing other analog IPs.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AE0</name>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>No analog test signal connected (Alta: GPIO28).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATB0</name>
                  <description>ATB0 connected. This controls only the GPIO analog switch. In order to get the test signal to GPIO.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTD</name>
                  <description>MCPLL OUTD output connected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Not allowed (both slices enabled).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AE1</name>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>No analog test signal connected (Alta: GPIO29).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATB1</name>
                  <description>ATB1 connected. This controls only the GPIO analog switch. In order to get the test signal to GPIO.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSCLK</name>
                  <description>MCPLL input connected. Can be used as reference or bypass clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Not allowed (both slices enabled).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
