adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
        <register>
          <name>RCOSC32KICALLENGTH</name>
          <description>32kHz RC oscillator calibration length This value is read from FICR</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>RCOSC32KICALLENGTH</name>
              <description>32kHz RC oscillator calibration length in number of cycles</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N128</name>
                  <description>128 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N256</name>
                  <description>256 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N512</name>
                  <description>512 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOSC32KICOARSEIN</name>
          <description>RCOSC coarse calibration input This value is read from FICR</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RCOSC32KICOARSEIN</name>
              <description>RCOSC coarse calibration input</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOSC32KICIRC</name>
          <description>Rotating current source for for 32.768 kHz RC oscillator</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RCS</name>
              <description>Enable or disable use of external rotating current source for 32.768 kHz RC oscillator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ATECLOCK</name>
          <description>Analog test bus control for clock modules</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RCOSC32K</name>
              <description>Connect or disconnect 32.768 kHz RC oscillator to analog test bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect internal regulator output to ATB0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFRCMODE</name>
          <description>LFRC mode configuration</description>
          <addressOffset>0x5B4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Set LFRC mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>Ultra-low power mode (ULP)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFULP32KICOARSEIN</name>
          <description>LFULP coarse calibration input This value is read from FICR</description>
          <addressOffset>0x5B8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LFULP32KICOARSE</name>
              <description>LFULP coarse calibration input</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LFULP32KICALLENGTH</name>
          <description>32kHz LFULP RC oscillator calibration length This value is read from FICR</description>
          <addressOffset>0x5BC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LFULP32KICALLENGTH</name>
              <description>32kHz ULP RC oscillator calibration length in number of cycles</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N128</name>
                  <description>128 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N256</name>
                  <description>256 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N512</name>
                  <description>512 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISBALERCOSC32KIPOWERUPCONTROL</name>
          <description>Backdoor for disabling Rcosc32KiPowerUpControl module in Rcosc32KiGenerator.</description>
          <addressOffset>0xBFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Disable</name>
              <description>Disable Rcosc32KiPowerUpControl.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Rcosc32KiPowerUpControl is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Rcosc32KiPowerUpControl is disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
