adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
        <register>
          <name>BAUDRATE</name>
          <description>Baud rate</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>BAUDRATE</name>
              <description>Baud-rate</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Baud1200</name>
                  <description>1200 baud (actual rate: 1221)</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud2400</name>
                  <description>2400 baud (actual rate: 2365)</description>
                  <value>0x0001F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud4800</name>
                  <description>4800 baud (actual rate: 4807)</description>
                  <value>0x0003F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud9600</name>
                  <description>9600 baud (actual rate: 9613)</description>
                  <value>0x0007E000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud14400</name>
                  <description>14400 baud (actual rate: 14420)</description>
                  <value>0x000BD000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud19200</name>
                  <description>19200 baud (actual rate: 19226)</description>
                  <value>0x000FC000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud28800</name>
                  <description>28800 baud (actual rate: 28767)</description>
                  <value>0x00179000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud38400</name>
                  <description>38400 baud (actual rate: 38388)</description>
                  <value>0x001F7000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud57600</name>
                  <description>57600 baud (actual rate: 57637)</description>
                  <value>0x002F3000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud76800</name>
                  <description>76800 baud (actual rate: 76775)</description>
                  <value>0x003EE000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud115200</name>
                  <description>115200 baud (actual rate: 115274)</description>
                  <value>0x005E6000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud230400</name>
                  <description>230400 baud (actual rate: 229885)</description>
                  <value>0x00BC0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud250000</name>
                  <description>250000 baud</description>
                  <value>0x00CC8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud460800</name>
                  <description>460800 baud (actual rate: 462428)</description>
                  <value>0x017A0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud921600</name>
                  <description>921600 baud (actual rate: 919540)</description>
                  <value>0x02F00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud1M</name>
                  <description>1Mega baud</description>
                  <value>0x03300000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXD</name>
          <description>RXD EasyDMA channel</description>
          <headerStructName>UARTE_RXD</headerStructName>
          <addressOffset>0x534</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes in receive buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in receive buffer</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>TXD EasyDMA channel</description>
          <headerStructName>UARTE_TXD</headerStructName>
          <addressOffset>0x544</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes in transmit buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in transmit buffer</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CONFIG</name>
          <description>Configuration of parity and hardware flow control</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HWFC</name>
              <description>Hardware flow control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>Parity</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude parity bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include parity bit</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
