adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOTE0_NS">
      <name>GPIOTE1_NS</name>
      <description>GPIO Tasks and Events 1</description>
      <baseAddress>0x40031000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <interrupt>
        <name>GPIOTE1</name>
        <value>49</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SECCONTROL_NS</name>
      <description>Secure Control</description>
      <baseAddress>0x40032000</baseAddress>
      <headerStructName>SECURECONTROL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SECURECONTROL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>OTPTOPADDR</name>
          <description>Top address of the OTP area. Address must be divisible by four</description>
          <addressOffset>0x400</addressOffset>
          <access>writeonce</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>OTPTOPADDR</name>
              <description>Top address of the OTP area.  This register type is WRITE ONCE.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREEXIT</name>
          <description>Writing to this register will enable secure exit.</description>
          <addressOffset>0x404</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECUREEXIT</name>
              <description>Writing to this register will enable secure exit.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECUREEXIT</name>
                  <description>Secure Exit disabled. Secure Exit enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SNOOPENABLE</name>
          <description>Enable SecureEntry snooping.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SNOOPENABLE</name>
              <description>Enable SecureEntry snooping.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure Entry sequence snooping disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure Entry sequence snooping enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDMAPROMOTION</name>
          <description>AES DMA promoted as a secure device.</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AESDMAPROMOTION</name>
              <description>AES DMA promotion as a secure device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nonsecure</name>
                  <description>AES DMA is a nonsecure device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>AES DMA is a secure device.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADMAPROMOTION</name>
          <description>SHA DMA promoted as a secure device.</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHADMAPROMOTION</name>
              <description>SHA DMA promotion as a secure device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nonsecure</name>
                  <description>AES DMA is a nonsecure device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>AES DMA is a secure device.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREWATCHDOGPAUSE</name>
          <description>Secure watchdog pause control.</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECUREWDPAUSE</name>
              <description>Secure watchdog pause control.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Secure WD running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Paused</name>
                  <description>Secure WD paused.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KMUENA</name>
          <description>SICR erase protection.</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KMUENA</name>
              <description>SICR erase protection.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>SICR erase protection off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>SICR erase protection on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMWAITSTATE</name>
          <description>Modem M4 RAM wait state configuration.</description>
          <addressOffset>0x420</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>RAMAWAITSTATE</name>
              <description>Wait state for RAM bank A.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WaitState0</name>
                  <description>Wait state of 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WaitState1</name>
                  <description>Wait state of 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMBWAITSTATE</name>
              <description>Wait state for RAM bank B.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WaitState0</name>
                  <description>Wait state of 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WaitState1</name>
                  <description>Wait state of 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMCWAITSTATE</name>
              <description>Wait state for RAM bank C.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WaitState0</name>
                  <description>Wait state of 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WaitState1</name>
                  <description>Wait state of 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMDWAITSTATE</name>
              <description>Wait state for RAM bank D.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WaitState0</name>
                  <description>Wait state of 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WaitState1</name>
                  <description>Wait state of 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
