adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CTRL_AP_PERI_S</name>
      <description>Control access port</description>
      <baseAddress>0x4003D000</baseAddress>
      <headerStructName>CTRLAPPERI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTRLAPPERI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CTRLDAP2COREDATA</name>
          <description>Data sent from the Debugger to the Core</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>General Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLDAP2CORESTATUS</name>
          <description>Status to indicate if Data sent from the Debugger to the Core has been read</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status of data in CTRLDAP2COREDATA register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoDataPending</name>
                  <description>No data pending in CTRLDAP2COREDATA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataPending</name>
                  <description>Data pending in CTRLDAP2COREDATA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE2CTRLDAPDATA</name>
          <description>Data sent from the Core to the Debugger</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>General Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE2CTRLDAPSTATUS</name>
          <description>Status to indicate if Data sent from the Core to the Debugger status has been read</description>
          <addressOffset>0x484</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status of data in CORE2CTRLDAPDATA register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoDataPending</name>
                  <description>No data pending in CTRLDAP2COREDATA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataPending</name>
                  <description>Data pending in CTRLDAP2COREDATA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPURETURNFIELD_LOCK</name>
          <description>Lock Mail Box erase all mechanism</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Enable or disable the erase all mechanism for return field case. A write once register.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Eraseall for return field can be issued</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Eraseall for return field is locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPURETURNFIELD</name>
          <description>Mail box erase all control register. A write once register.</description>
          <addressOffset>0x504</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Random value to generate a eraseall for return field case.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>L2CIPHER_NS</name>
      <description>L2 Cipher Registers</description>
      <baseAddress>0x40040000</baseAddress>
      <headerStructName>L2CIPHER</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>L2CIPHER</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
