adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GATHER_STARTED</name>
              <description>Write '1' to disable interrupt for event GATHER_STARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATHER_DONE</name>
              <description>Write '1' to disable interrupt for event GATHER_DONE</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED</name>
              <description>Write '1' to disable interrupt for event UNUSED</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHA_READY</name>
              <description>Write '1' to disable interrupt for event SHA_READY</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MESSAGE_READY</name>
              <description>Write '1' to disable interrupt for event MESSAGE_READY</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETTED</name>
              <description>Write '1' to disable interrupt for event RESETTED</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LENGTH</name>
          <description>Message length in bits.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>Message length in bits.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Configuration.</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE SELECTION</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHA_1</name>
                  <description>SHA-1 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_256</name>
                  <description>SHA-256 mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>H7</name>
          <description>Final result H7 (SHA-256), H4 (SHA-1). Updated after every 512bit block calculated.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data7</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H6</name>
          <description>Final result H6 (SHA-256), H3 (SHA-1). Updated after every 512bit block calculated.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data6</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H5</name>
          <description>Final result H5 (SHA-256), H2 (SHA-1). Updated after every 512bit block calculated.</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data5</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H4</name>
          <description>Final result H4 (SHA-256), H1 (SHA-1). Updated after every 512bit block calculated.</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data4</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H3</name>
          <description>Final result H3 (SHA-256), H0 (SHA-1). Updated after every 512bit block calculated.</description>
          <addressOffset>0x610</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data3</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H2</name>
          <description>Final result H2 (SHA-256). Updated after every 512bit block calculated.</description>
          <addressOffset>0x614</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data2</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H1</name>
          <description>Final result H1 (SHA-256). Updated after every 512bit block calculated.</description>
          <addressOffset>0x618</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H0</name>
          <description>Final result H0 (SHA-256). Updated after every 512bit block calculated..</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H7_R</name>
          <description>Final result H7_R (SHA-256), H4_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x630</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data7</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H6_R</name>
          <description>Final result H6_R (SHA-256), H3_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x634</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data6</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H5_R</name>
          <description>Final result H5_R (SHA-256), H2_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x638</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data5</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H4_R</name>
          <description>Final result H4_R (SHA-256), H1_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data4</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H3_R</name>
          <description>Final result H3_R (SHA-256), H0_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data3</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H2_R</name>
          <description>Final result H2_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x644</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data2</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H1_R</name>
          <description>Final result H1_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated.</description>
          <addressOffset>0x648</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>H0_R</name>
          <description>Final result H0_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated..</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Data</name>
              <description>Data0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INBYTECOUNT</name>
          <description>Bytes transferred in current job.</description>
          <addressOffset>0x750</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INBYTECOUNT</name>
              <description>Bytes transferred in current job.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INJOBPTR</name>
          <description>Input job pointer.</description>
          <addressOffset>0x800</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INJOBPTR</name>
              <description>Input job pointer.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
