adamkondraciuk/nrfx/mdk/nrf9120_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMC_NS</name>
      <description>Non Volatile Memory Controller</description>
      <baseAddress>0x40060000</baseAddress>
      <alternatePeripheral>ACL_NS</alternatePeripheral>
      <headerStructName>NVMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>NVMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC is ready or busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READYNEXT</name>
          <description>Ready flag</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>READYNEXT</name>
              <description>NVMC can accept a new write operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC cannot accept any write operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEen</name>
                  <description>Partial Erase enabled</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Erase all non-volatile memory including UICR registers. Note that the erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIALCFG</name>
          <description>Register for partial erase configuration</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>DURATION</name>
              <description>Duration of the partial erase in milliseconds</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSTATENUM</name>
          <description>Register to set the number of waitstate for flash access To update the WAITSTATENUM field, the ACCESSCODE must be correct.</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAITSTATENUM</name>
              <description>Flash wait states</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ACCESSCODE</name>
              <description>Access code for modifying this register</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHECNF</name>
          <description>I-code cache configuration register.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CACHEEN</name>
              <description>Cache enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache. Invalidates all cache entries.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEPROFEN</name>
              <description>Cache profiling enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache profiling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache profiling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IHIT</name>
          <description>I-code cache hit counter.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HITS</name>
              <description>Number of cache hits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IMISS</name>
          <description>I-code cache miss counter.</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISSES</name>
              <description>Number of cache misses</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIGNS</name>
          <description>Non SecureConfiguration register</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITEUICRNS</name>
          <description>Non Secure APPROTECT enable register</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET</name>
              <description>Allow non secure to set APPROTECT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Key to write in order to valid the write operation</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Keyvalid</name>
                  <description>Key value</description>
                  <value>0xAFBE5A7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMODE</name>
          <description>Register for entering test mode. Refer to the flash IP test documentation for more details.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTMODE</name>
              <description>Register for entering test mode. Refer to the flash IP test documentation for more details. This register does not return the same value as written.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Read: Not in test-mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE1</name>
                  <description>Read: In test-mode 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE2</name>
                  <description>Read: In test-mode 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE3</name>
                  <description>Read: In test-mode 3.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>SetNORMAL</name>
                  <description>Write: Sets NORMAL mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE1</name>
                  <description>Write: Sets test-mode 1.</description>
                  <value>0xBCDE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE2</name>
                  <description>Write: Sets test-mode 2.</description>
                  <value>0xABCD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE3</name>
                  <description>Write: Sets test-mode 3.</description>
                  <value>0xCDEF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVEN</name>
          <description>Low voltage read mode</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LVEN</name>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable low voltage read mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable low voltage read mode.</description>
                  <value>0x6005EA5E</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMASSERASE</name>
          <description>Self-timed mass-erase operation</description>
          <addressOffset>0x610</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTMASSERASE</name>
              <description>Self-timed mass-erase operation</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVERYTHING</name>
                  <description>Erase everything (all information pages and main block)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Erase only the main block</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION1</name>
                  <description>No operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTERASEREFCELL</name>
          <description>Self-timed erase reference cell operation</description>
          <addressOffset>0x614</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTERASEREFCELL</name>
              <description>Self-timed erase reference cell operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the erase reference cell operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTTC</name>
          <description>Observe the TC output from the flash macro</description>
          <addressOffset>0x618</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TC</name>
              <description>TC output</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TESTDATA128[%s]</name>
          <description>Description collection: Direct flash test data word n</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTDATA</name>
              <description>Returns data out from flash when reading. Sets flash data in when writing.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TESTDATA128INC[%s]</name>
          <description>Description collection: Direct flash test data word n. Post-increments TESTCONTROLADDR</description>
          <addressOffset>0x630</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTDATA</name>
              <description>Returns data out from flash when reading. Use TESTDATA128[3:0] registers to set the compared data. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCMPINC</name>
          <description>Reads and compares last flash row to TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIRECT</name>
              <description>Reads and compares last flash row (direct lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Equal</name>
                  <description>Direct TESTDATA128 content and flash row read are equal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotEqual</name>
                  <description>Direct TESTDATA128 content and flash row read are different</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATCHED</name>
              <description>Reads and compares last flash row (latched lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Equal</name>
                  <description>Latched TESTDATA128 content and flash row read are equal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotEqual</name>
                  <description>Latched TESTDATA128 content and flash row read are different</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
